InformationRegisters/ИсторияРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ИсторияРеквизитов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ИсторияРеквизитов/Ext/Module.bsl
Функция Получить(Ссылка, Реквизит, Дата, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Данные = РегистрыСведений.ИсторияРеквизитов.ПолучитьПоследнее(Дата, Новый Структура("Ссылка,Реквизит", Ссылка, Реквизит));
	Возврат ?(ЗначениеЗаполнено(Данные.Значение), Данные.Значение, ЗначениеПоУмолчанию);
КонецФункции

Функция Установить(Ссылка, Реквизит, Значение, Дата) Экспорт
	Движение = РегистрыСведений.ИсторияРеквизитов.СоздатьМенеджерЗаписи();
	Движение.Период = Дата;
	Движение.Ссылка = Ссылка;
	Движение.Реквизит = Реквизит;
	Движение.Значение = Значение;
КонецФункции
